app/controllers/admin/boards_controller.rb

  def update
    @board = Board.find(params[:id])

    respond_to do |format|
      if @board.update_attributes(params[:board])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "boards" SET "name" = 'Board 1', "updated_at" = '2011-07-14 04:34:52.467116' WHERE "boards"."id" = 1