app/controllers/boards_controller.rb

INSERT INTO "boards" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 13 Jul 2011 04:40:33 UTC +00:00], ["name", "1"], ["updated_at", Wed, 13 Jul 2011 04:40:33 UTC +00:00]]
---
  def create
    @board = Board.new(params[:board])

    respond_to do |format|
      if @board.save