app/controllers/posts_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def index
    @board = Board.find(params[:board_id])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."board_id" = 1 AND "posts"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @board = Board.find(params[:board_id])
    @post = @board.posts.find(params[:id])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @board = Board.find(params[:board_id])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "posts" ("board_id", "content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["board_id", 3], ["content", "test "], ["created_at", Thu, 14 Jul 2011 02:50:35 UTC +00:00], ["title", "3 test "], ["updated_at", Thu, 14 Jul 2011 02:50:35 UTC +00:00], ["user_id", 1]]
---
  def create
    @board = Board.find(params[:board_id])
    @post = @board.posts.build(params[:post])
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 AND "posts"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    @board = Board.find(params[:board_id])
    #@post = @board.posts.find(params[:id])
    @post = current_user.posts.find(params[:id])
    @post.destroy