app/controllers/posts_controller.rb

  def destroy
    @board = Board.find(params[:board_id])
    @post = @board.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."board_id" = 1 AND "posts"."id" = ? LIMIT 1  [["id", "2"]]